tap "aws/tap"
tap "hashicorp/tap"
tap "max-sixty/worktrunk"
tap "oven-sh/bun"

brew "zsh"
brew "tmux"
brew "vim"
brew "btop"
brew "htop"

brew "jj"
brew "git"
brew "difftastic"
brew "mergiraf"

brew "bat"
brew "curl"
brew "tree"
brew "flock"
brew "gcc"
brew "gnupg"
brew "pigz"
brew "pv"
brew "scc"
brew "sd"
brew "wrk"
brew "tailscale"

brew "fd"
brew "fzf"
brew "jq"
brew "ripgrep"

brew "aria2"
brew "max-sixty/worktrunk/wt"
brew "ollama"
brew "repomix"

brew "libpq"
brew "pgcli"
brew "postgresql"
brew "sqlite"

brew "ruff"
brew "uv"

brew "node"
brew "nvm"
brew "oven-sh/bun/bun"
brew "yarn"

brew "biome"
brew "djlint"
brew "eslint"
brew "pyright"
brew "python-lsp-server"
brew "stylelint"
brew "typescript-language-server"
brew "pre-commit"
brew "prek"

brew "ghcup"
brew "rustup"

brew "aws/tap/copilot-cli"
brew "awscli"
brew "hashicorp/tap/terraform"

brew "docker"
brew "docker-completion"
brew "docker-compose"

cask "brave-browser"
cask "firefox"
cask "ghostty"
cask "orbstack"
cask "proton-drive"
cask "rectangle"
cask "vlc"
