tap "oven-sh/bun"
tap "hashicorp/tap"
tap "aws/tap"

brew "ansible"
brew "aria2"
brew "aws/tap/copilot-cli"
brew "awscli"
brew "bat"
brew "caddy"
brew "curl"
brew "docker"
brew "docker-completion"
brew "docker-compose"
brew "fd"
brew "fzf"
brew "gcc"
brew "ghcup"
brew "git"
brew "gnupg"
brew "hashicorp/tap/terraform"
brew "htop"
brew "jq"
brew "libpq"
brew "node"
brew "nvm"
brew "ollama"
brew "oven-sh/bun/bun"
brew "postgresql"
brew "repomix"
brew "ripgrep"
brew "ruff"
brew "rustup"
brew "scc"
brew "skopeo"
brew "sqlite"
brew "tmux"
brew "tree"
brew "uv"
brew "vim"
brew "wrk"
brew "zsh"

cask "brave-browser"
cask "firefox"
cask "ghostty"
cask "orbstack"
cask "proton-drive"
cask "rectangle"
cask "vlc"
