brew "ansible"
brew "aria2"
brew "awscli"
brew "caddy"
brew "curl"
brew "docker"
brew "docker-completion"
brew "docker-compose"
brew "fd"
brew "fzf"
brew "ghcup"
brew "gnupg"
brew "htop"
brew "jq"
brew "libpq"
brew "node"
brew "opentofu"
brew "repomix"
brew "ripgrep"
brew "ruff"
brew "scc"
brew "sqlite"
brew "tmux"
brew "tree"
brew "uv"
brew "vim"
brew "wrk"
brew "zsh"

cask "brave-browser"
cask "ghostty"
cask "orbstack"
cask "proton-drive"
cask "rectangle"
cask "vlc"
